Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Inputo (InputLayer)             [(None, 187, 1)]     0                                            
__________________________________________________________________________________________________
Conv1D_1 (Conv1D)               (None, 187, 32)      192         Inputo[0][0]                     
__________________________________________________________________________________________________
Conv1_1 (Conv1D)                (None, 187, 32)      5152        Conv1D_1[0][0]                   
__________________________________________________________________________________________________
Conv2_1 (Conv1D)                (None, 187, 32)      5152        Conv1_1[0][0]                    
__________________________________________________________________________________________________
ResidualSum_1 (Add)             (None, 187, 32)      0           Conv2_1[0][0]                    
                                                                 Conv1D_1[0][0]                   
__________________________________________________________________________________________________
Act_relu_1 (Activation)         (None, 187, 32)      0           ResidualSum_1[0][0]              
__________________________________________________________________________________________________
MaxPool_1 (MaxPooling1D)        (None, 92, 32)       0           Act_relu_1[0][0]                 
__________________________________________________________________________________________________
Conv1_2 (Conv1D)                (None, 92, 32)       5152        MaxPool_1[0][0]                  
__________________________________________________________________________________________________
Conv2_2 (Conv1D)                (None, 92, 32)       5152        Conv1_2[0][0]                    
__________________________________________________________________________________________________
ResidualSum_2 (Add)             (None, 92, 32)       0           Conv2_2[0][0]                    
                                                                 MaxPool_1[0][0]                  
__________________________________________________________________________________________________
Act_relu_2 (Activation)         (None, 92, 32)       0           ResidualSum_2[0][0]              
__________________________________________________________________________________________________
MaxPool_2 (MaxPooling1D)        (None, 44, 32)       0           Act_relu_2[0][0]                 
__________________________________________________________________________________________________
Conv1_3 (Conv1D)                (None, 44, 32)       5152        MaxPool_2[0][0]                  
__________________________________________________________________________________________________
Conv2_3 (Conv1D)                (None, 44, 32)       5152        Conv1_3[0][0]                    
__________________________________________________________________________________________________
ResidualSum_3 (Add)             (None, 44, 32)       0           Conv2_3[0][0]                    
                                                                 MaxPool_2[0][0]                  
__________________________________________________________________________________________________
Act_relu_3 (Activation)         (None, 44, 32)       0           ResidualSum_3[0][0]              
__________________________________________________________________________________________________
MaxPool_3 (MaxPooling1D)        (None, 20, 32)       0           Act_relu_3[0][0]                 
__________________________________________________________________________________________________
Conv1_4 (Conv1D)                (None, 20, 32)       5152        MaxPool_3[0][0]                  
__________________________________________________________________________________________________
Conv2_4 (Conv1D)                (None, 20, 32)       5152        Conv1_4[0][0]                    
__________________________________________________________________________________________________
ResidualSum_4 (Add)             (None, 20, 32)       0           Conv2_4[0][0]                    
                                                                 MaxPool_3[0][0]                  
__________________________________________________________________________________________________
Act_relu_4 (Activation)         (None, 20, 32)       0           ResidualSum_4[0][0]              
__________________________________________________________________________________________________
MaxPool_4 (MaxPooling1D)        (None, 8, 32)        0           Act_relu_4[0][0]                 
__________________________________________________________________________________________________
Conv1_5 (Conv1D)                (None, 8, 32)        5152        MaxPool_4[0][0]                  
__________________________________________________________________________________________________
Conv2_5 (Conv1D)                (None, 8, 32)        5152        Conv1_5[0][0]                    
__________________________________________________________________________________________________
ResidualSum_5 (Add)             (None, 8, 32)        0           Conv2_5[0][0]                    
                                                                 MaxPool_4[0][0]                  
__________________________________________________________________________________________________
Act_relu_5 (Activation)         (None, 8, 32)        0           ResidualSum_5[0][0]              
__________________________________________________________________________________________________
MaxPool_5 (MaxPooling1D)        (None, 2, 32)        0           Act_relu_5[0][0]                 
__________________________________________________________________________________________________
flatten (Flatten)               (None, 64)           0           MaxPool_5[0][0]                  
__________________________________________________________________________________________________
FC1 (Dense)                     (None, 32)           2080        flatten[0][0]                    
__________________________________________________________________________________________________
FC2 (Dense)                     (None, 32)           1056        FC1[0][0]                        
__________________________________________________________________________________________________
Output (Dense)                  (None, 5)            165         FC2[0][0]                        
==================================================================================================
Total params: 55,013
Trainable params: 3,493
Non-trainable params: 51,520
__________________________________________________________________________________________________